
// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: TRASHART MASHUPS
/// @author: manifold.xyz

import "./ERC721Creator.sol";

////////////////////////////
//                        //
//                        //
//    †RÄ§HÄR† MÄ§HÚþ§    //
//    ʙʏ ᴄᴏʟʟɪɴ.ᴇᴛʜ       //
//                        //
//    . ___/-\___         //
//    |---------|         //
//      | | | | |         //
//      | | | | |         //
//      | | | | |         //
//      | | | | |         //
//      |_______|         //
//                        //
//    X                   //
//                        //
//    . ___/-\___         //
//    |---------|         //
//      | | | | |         //
//      | | | | |         //
//      | | | | |         //
//      | | | | |         //
//      |_______|         //
//                        //
//                        //
//    X                   //
//                        //
//    . ___/-\___         //
//    |---------|         //
//      | | | | |         //
//      | | | | |         //
//      | | | | |         //
//      | | | | |         //
//      |_______|         //
//                        //
//                        //
//                        //
//                        //
//                        //
//                        //
////////////////////////////


contract MASH is ERC721Creator {
    constructor() ERC721Creator("TRASHART MASHUPS", "MASH") {}
}
