
// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: Through the fantasy, the destiny of the villain
/// @author: manifold.xyz

import "./ERC721Creator.sol";

///////////////////////////////////////////////////////////////////////////////////////////////////////////
//                                                                                                       //
//                                                                                                       //
//    　大夏国，天蜀郡。                                                                                          //
//                                                                                                       //
//    　　六月的南风城，骄阳似火，炙烤大地。                                                                                //
//                                                                                                       //
//    　　南风中等学府。                                                                                          //
//                                                                                                       //
//    　　宽敞明亮的训练场。                                                                                        //
//                                                                                                       //
//    　　众多面容稚嫩，青春洋溢的少年少女穿着练功服，盘坐四周，目光望着场地中央，那里，有两道身影在快速的交锋比试，手中木剑在激烈碰撞间，有清脆的声音响起，回荡在训练场内。                //
//                                                                                                       //
//    　　场中两人，皆是约莫十五六岁，右边少年身躯欣长，面庞俊朗，眉下双目有神，身材气质皆是上佳，不提其他，光是这幅顶尖好皮囊，就引得场内一些少女明眸亮晶晶的投来时，眼含秋波，带着丝丝的羞涩之意。    //
//                                                                                                       //
//    　　“李洛，加油！”                                                                                         //
//                                                                                                       //
//    　　还有着胆大的少女发出助威声。                                                                                   //
//                                                                                                       //
//    　　而在那名为李洛的少年前方，则是一名身躯魁梧的少年，后者面容则是显得粗犷不少，再加上皮肤黝黑，与李洛对比起来，当真是宛如人与黑熊一般。                               //
//                                                                                                       //
//    　　所以当他在听见那些为李洛助威的少女声音时，顿时有些嫉妒的咧咧嘴巴，旋即喝道：“李洛，我可不放水了！”                                               //
//                                                                                                       //
//                                                                                                       //
///////////////////////////////////////////////////////////////////////////////////////////////////////////


contract TTFTB is ERC721Creator {
    constructor() ERC721Creator("Through the fantasy, the destiny of the villain", "TTFTB") {}
}
