
// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: Eugene
/// @author: manifold.xyz

import "./ERC721Creator.sol";

/////////////////////////////////////////////////////////////////////////////////////////////////////////////
//                                                                                                         //
//                                                                                                         //
//                                                                                                         //
//              **MMÑÑÑ****MMÑÑÑÑ                                                                          //
//                ,ÑÑÑ       *ÑÑ                                                                           //
//                ÑÑÑ                                                                                      //
//               0ÑÑ       0       ,a@W      #@    ,WW=a_a40W    a#6?  @@   a@0W    ,aW@      _a#Ñ?Wc.     //
//              #ÑÑ@,,;;,aÑ      aÑÑÑÑÑ    ,ÑÑÑ   0Ñ   1Ñ      #ÑÑ   _#ÑÑ  Ñ?1Ñ  ,#Ñ #ÑÑ    ,@Ñ?   ,@ÑÑ    //
//             1ÑÑÑ       0        0ÑÑ    ,ÑÑÑ   1ÑÑ   0Ñ    ;ÑÑ,,a#0ÑÑÑ    1Ñ a0Ñ  1ÑÑ    #ÑÑ_;a#0ÑÑ?     //
//            ;ÑÑÑ                #ÑÑ    #ÑÑÑ    !Ñ   #Ñ.   ,ÑÑ            1ÑWÑ.   1ÑÑÑ   1ÑÑ              //
//           ,ÑÑÑ          a     1ÑÑ   aÑ #Ñ       #!Ñ.     0ÑÑ           ;ÑÑÑ    ;ÑÑÑ    ÑÑb              //
//           ÑÑÑ         ;ÑÑ    ,ÑÑ_ aÑ  1Ñ aÑ    0Wc       1ÑÑ_    #    ,ÑÑÑ    ,ÑÑÑ;#Ñ  0ÑÑ    ,0        //
//       aaW0ÑÑWaaaaaaWWÑÑÑÑ    1ÑÑ9?    ÑÑÑ    _,a#ÑÑÑ@W,   7ÑÑ@@0Ñ     ?Ñ.     0ÑÑÑ.     ÑÑÑ@@0Ñ         //
//                                            ,0Ñ       ÑÑ@                                                //
//                                            1ÑÑ         ÑÑ                                               //
//                                              ÑÑW,____,#Ñ                                                //
//                                                                                                         //
//                                                                                                         //
//                                                                                                         //
/////////////////////////////////////////////////////////////////////////////////////////////////////////////


contract EUGE is ERC721Creator {
    constructor() ERC721Creator("Eugene", "EUGE") {}
}
