// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: バブルガム
/// @author: manifold.xyz

import "./ERC721Creator.sol";

/////////////////////////////////////
//                                 //
//                                 //
//    ########バブルガム#########       //
//    #(\_/) (\_/) (\_/) (\_/)#    //
//    #(X.O) (X.O) (X.O) (X.O)#    //
//    #########################    //
//    #(\_/) (\_/) (\_/) (\_/)#    //
//    #(X.O) (X.O) (X.O) (X.O)#    //
//    #########################    //
//    #(\_/) (\_/) (\_/) (\_/)#    //
//    #(X.O) (X.O) (X.O) (X.O)#    //
//    #########################    //
//                                 //
//                                 //
/////////////////////////////////////


contract BBGXO is ERC721Creator {
    constructor() ERC721Creator(unicode"バブルガム", "BBGXO") {}
}
