
// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: fdoganis
/// @author: manifold.xyz

import "./ERC721Creator.sol";

////////////////////////////////////////////////////////////////////////////////
//                                                                            //
//                                                                            //
//                                                                            //
//                                                                            //
//                                                                            //
//                                 ΒΦ´ Ο,;,,,                                 //
//                              Β  ΦΒΟΦΦΦ` ,ΟΙΟΟ,.                            //
//                             ΦΦΦΦΦΦΦΦΦΦΦΦΦΒΦΦΦΦΒΒ;                          //
//                              ΦΦΦΦΦΒΦΦΦΦΦΦΦΦΦΦΒΦΦΒ                          //
//                              ΦΦΒΒΒΒΒΦΒΒΒΒΦΒΟΣ,`ΙΦΒ;           Β            //
//                             ΙΦΦΦΦΦΒΒΒΦΒΟΟΙΙΣΙ´´ΟΦΒΒΒΙΟ        Ι            //
//                            ,ΦΒΒΒΦΦΦΦΒΒΟΙΙΙ!'! .ΣΦΦΒΒΣΒΣ-!`     Β           //
//                            ΒΦΦΒΒΒΒΒΣΙΙΙΙΙΟ'  ´´!ΟΣΟ-!!ΟΟ!     !Β           //
//                           ;ΒΒΒΟΒΟΙΙΙΙΟΟ;;´       ΙΙ;-; Σ; ,  ,;Σ           //
//                           ΦΒΒΒΙΙΟΦΦΦΦΦΦΦΦΦ;        ΣΒΦ ΦΦΦΦΒΒΣ             //
//                            ΦΒΦΒΒΟΦΒΒΦΦΦΒΒΒΒΒ!      ΣΦ,ΦΦΦΦΦΒΒ              //
//                             ΒΦΒΟΦΦΦΦΦΦΦΒΒΦΟΒΙ;´    Φ! ΦΦΦΦΦΦΒ              //
//                            !ΦΒΟΙΙΒΦΒΦΒΒΒΒΟ;!!! ´.`!` !ΦΦΦΦΦΦΒ              //
//                            !ΒΟ!!!ΙΙΟΒΒΒΒΟΟΙΙ!.;.-'-´ ΦΦΦΦΦΦΒ-              //
//                            ΣΟ!!!ΙΣ!ΒΟΟΟΒΟΟΙΙΙ!!!´'ΙΒ´ΦΦΦΦΦΦΒ               //
//                            !ΙΙΒΒΣΙ,ΦΒΒΟΟΟΟΟΟΟΙΙ!;ΒΦΦ ´ΦΦΦΦΦΒ               //
//                             ΦΦΦΒΦΦΒΦΦΒΒΟΙΙΙΟΙΙΙΙΙΒΟ!                       //
//                              ΒΦΒΒΦΦΒΒΦΒΦΦΟ!!Σ´!ΙΟ;!                        //
//                              `ΦΦΦΦΦΦΦΦΦΦΒΒΟ!´.!ΙΙΙ´                        //
//                               `ΦΦΒΒΒΒΦΦΦΒΦΒΙ;;''     ;!´                   //
//                                 ΦΦΒΦΦΦΦΒΒΦΦΒΣ`     ΙΟΙ!                    //
//                                 ΒΦΒΒΒΦΒΒΦΒ`     ,;ΦΦΒΟ,     '              //
//                                   ```` Β  ,;!;;ΦΒΒΒΦΦΟ!-     ..     .-     //
//                                         ΒΦΒΒΦΦΒΦΒΒΒΦΦΒΣΙ     .'    .!!´    //
//                                ´. -      ΦΦΒΦΒΦΒΦΦΦΦΦΦΣ     .'  ´.;!       //
//                              ´..-;!.     ΦΒΒΦΒΦΦΦΦΦΦΣ!   ' .'  .,;!        //
//                            ;ΟΙ!;;!!';!''!`ΦΦΦΦΦΦΦΒ!. .´,;,,´ ´.;!´         //
//                            ΟΟΟ!ΙΙ!!;!!.. '´!!!! .´;!!;;!';Ο´,!!!           //
//                                ´!Ι;Ι!!!..      ´´!!;!;!!;Ο'!!!!            //
//                                      ´´-;.'...',!' .!´!!Ι´;Ι!!Σ            //
//                                              -;!-,.;!;!; .!!!ΙΣ            //
//                                                  ``!!;!Σ.;!!ΙΟ             //
//                                                        ´´!ΙΙΣ              //
//                                                                            //
//                                                                            //
//                                                                            //
////////////////////////////////////////////////////////////////////////////////


contract FDOG is ERC721Creator {
    constructor() ERC721Creator("fdoganis", "FDOG") {}
}
