
// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: Cryptogenik's Everyotherdays
/// @author: manifold.xyz

import "./ERC721Creator.sol";

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//                                                                                                                                     //
//                                                                                                                                     //
//                                                                                                                                     //
//    ░█████╗░██████╗░██╗░░░██╗██████╗░████████╗░█████╗░░██████╗░███████╗███╗░░██╗██╗██╗░░██╗                                          //
//    ██╔══██╗██╔══██╗╚██╗░██╔╝██╔══██╗╚══██╔══╝██╔══██╗██╔════╝░██╔════╝████╗░██║██║██║░██╔╝                                          //
//    ██║░░╚═╝██████╔╝░╚████╔╝░██████╔╝░░░██║░░░██║░░██║██║░░██╗░█████╗░░██╔██╗██║██║█████═╝░                                          //
//    ██║░░██╗██╔══██╗░░╚██╔╝░░██╔═══╝░░░░██║░░░██║░░██║██║░░╚██╗██╔══╝░░██║╚████║██║██╔═██╗░                                          //
//    ╚█████╔╝██║░░██║░░░██║░░░██║░░░░░░░░██║░░░╚█████╔╝╚██████╔╝███████╗██║░╚███║██║██║░╚██╗                                          //
//    ░╚════╝░╚═╝░░╚═╝░░░╚═╝░░░╚═╝░░░░░░░░╚═╝░░░░╚════╝░░╚═════╝░╚══════╝╚═╝░░╚══╝╚═╝╚═╝░░╚═╝                                          //
//     .-.-.   .-.-.   .-.-.   .-.-.   .-.-.   .-.-.   .-.-.   .-.-.   .-.-.   .-.-.   .-.-.   .-.                                     //
//    / / \ \ / / \ \ / / \ \ / / \ \ / / \ \ / / \ \ / / \ \ / / \ \ / / \ \ / / \ \ / / \ \ / /                                      //
//    -'   `-`-'   `-`-'   `-`-'   `-`-'   `-`-'   `-`-'   `-`-'   `-`-'   `-`-'   `-`-'   `-`-'                                       //
//                       ,.  _~-.,               .                                                                                     //
//                    ~'`_ \/,_. \_                                                                                                    //
//                   / ,"_>@`,__`~.)             |           .       GM                                                                //
//                   | |  @@@@'  ",! .           .          '         B̳E̳L̳̳I̳̳E̳̳V̳E̳                                                //
//                   |/   ^^@     .!  \          |         /                 GN                                                        //
//                   `' .^^^     ,'    '         |        .             .                                                              //
//                    .^^^   .          \                /          .                                                                  //
//                   .^^^       '  .     \       |      /       . '                                                                    //
//                   ^^^             ` .   .,+~'`^`'~+,.     , '                                                                       //
//                ,,^^^^^.  . ._ ..__ _  .'             '. '_ __ ____ __ _ .. .  .   .    .                                            //
//    ︵‿︵‿︵,;;;;;;;;;;;;;;;;;;;;;;;;,.︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿                                                                   //
//    ‿︵‿︵,;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;,︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵                                                                 //
//    ‿︵~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~ ‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿                                                              //
//    ︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿                                                                               //
//    ‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵                                                                               //
//    ~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^                                       //
//      .--.      .-'.      .--.      .--.      .--.      .--.      .`-.      .--.                                                     //
//    :::::.\::::::::.\::::::::.\::::::::.\::::::::.\::::::::.\::::::::.\::::::::.\>>>   §̳¿̳§                                         //
//    '      `--'      `.-'      `--'      `--'      `--'      `-.'      `--'                                                          //
//    ~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^~^                                       //
//    ︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿                                                                               //
//    ‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿                                                                              //
//    ︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿                                                                               //
//    ‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿︵‿                                                                              //
//                                                                                                                                     //
//                                                                                                                                     //
//    Welcome to the ᗪᕮᕮᑭ ᘉ〇ᗪᕮ. Cryptogenik's Personal Everyotherday collection.                                                       //
//    Щно їи тнё шоґld aм Ї?' Дн, тнaт's тнє gяєaт pцzzlё!                                                                             //
//    I don't make one Everday like Beeple. It's not even every other day, more like when I feel like it.                              //
//    I create limited editions for my friend's fans and colleagues.                                                                   //
//    I keep 1 for myself.                                                                                                             //
//    I give 1 to each of my friends.                                                                                                  //
//    Then 3 for sale to the public.                                                                                                   //
//    You have to run as fast as you can just to keep in the same place.                                                               //
//    If you want to get somewhere else, you must run at least twice as fast as that!                                                  //
//    Never imagine yourself not to be otherwise than what it might appear to others that                                              //
//    what you were or might have been was not otherwise than what you had been                                                        //
//    would have appeared to them to be otherwise. If there’s no meaning in it                                                         //
//    that saves a world of trouble, you know, as we needn’t try to find any.                                                          //
//    If this is confusing, DON'T PANIC. We're all mad here. +CG                                                                       //
//                                                                                                                                     //
//    /̴̢͙̞͛͛̈́R̴̟͇͇͊̓͆T̸̢̙͉̿̿̓/̸̠̺̘̒͑͝I̴̞͖̝͆̈́̕M̵̢̦̽̐̾I̵̠̠̼̐̽̒T̸̪͖̻͆̽̒Á̴̡̫̞́̒T̸͍͎̾͑̾E̴̼̪͔͒̿͘S̸̡̢͋͒͛/̸̢͔̞͛͆̚\̵͔͖͚̀̿̒R̴͚̪̼̐̈́͠T̴̡̝͉̀̒͝    //
//                                                                                                                                     //
//    T̳O̳ B̳̳E̳̳ Y̳̳O̳̳U̳̳R̳̳S̳̳E̳̳L̳̳F̳̳ I̳S̳ A̳L̳L̳ T̳H̳A̳T̳ Y̳O̳U̳ C̳A̳N̳ D̳O̳                                                     //
//                                                                                                                                     //
//    🅑🅔ⓁⒾⒺ🅥🅔                                                                                                                      //
//    ⒷⒺ🅛🅘🅔ⓋⒺ                                                                                                                       //
//                                                                                                                                     //
//                                                                                                                                     //
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


contract CGK is ERC721Creator {
    constructor() ERC721Creator("Cryptogenik's Everyotherdays", "CGK") {}
}
