
// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: 周五
/// @author: manifold.xyz

import "./ERC721Creator.sol";

//////////////////////////////
//                          //
//                          //
//    侠客行⑴                  //
//    赵客缦胡缨⑵，吴钩霜雪明⑶。        //
//    银鞍照白马，飒沓如流星⑷。         //
//    十步杀一人，千里不留行⑸。         //
//    事了拂衣去，深藏身与名。          //
//    闲过信陵饮⑹，脱剑膝前横。         //
//    将炙啖朱亥，持觞劝侯嬴⑺。         //
//    三杯吐然诺，五岳倒为轻⑻。         //
//    眼花耳热后，意气素霓生⑼。         //
//    救赵挥金槌，邯郸先震惊⑽。         //
//    千秋二壮士，烜赫大梁城⑾。         //
//    纵死侠骨香，不惭世上英。          //
//    谁能书阁下，白首太玄经⑿。 [1]     //
//                          //
//                          //
//////////////////////////////


contract five is ERC721Creator {
    constructor() ERC721Creator(unicode"周五", "five") {}
}
