
// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: Tide
/// @author: manifold.xyz

import "./ERC721Creator.sol";

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//                                                                                                                           //
//                                                                                                                           //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ@@ÑÑ133@@ÑÑÑÑ@ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ@@@Ñ1  @@Ñ155@@ÑÑ15@@ÑÑÑÑ0@ÑÑÑÑÑ@ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ@@0$  Wb911-bb9$!:bb0999Ñ@ÑÑ99Ñ0@@@ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ00+-WWW4- -==4!WWW++4=WÑÑ04==WÑÑ4!@@@ÑÑÑÑÑÑÑÑ0ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑWWÑ#4?-=W=4+===W4?4=WÑ4+--=Ñ++4@@@@@@ÑÑÑÑ00ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ4WWÑ844Wcc7?  -W7?!ÑÑÑÑ0#@@@@@@@ÑÑÑÑÑÑÑÑÑÑÑ0ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ123c222.   22132ÑÑÑÑ22@@@@@@@@ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ11@@@1!   221!3@@ÑÑ15@@@@@@@@@@ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$5@@@@!   ,;!!_b@0115@@@Ñ15@@@Ñ$55ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ@Ñ0!    ;!  WW0$44WW094==W@0$4W@@099ÑÑÑÑÑÑÑÑÑÑÑ0ÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ=    c++- cW#44WWÑÑ+4+=WÑ044ÑÑÑ04?WWÑÑ4!+ÑÑÑ44Ñ=@@@@    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ=--  -W+?.-=WÑ44ÑÑÑÑ444ÑÑÑ4?+-=c4?- -c+4?-WWÑ#44@@@@@    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ77 .c??  c22222WÑÑ222ÑÑÑ22!ÑW22?  b22?. .222?4WÑÑ#22@@@@@    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ1ÑÑÑ2?,  2221  b222332@21732222!._222?  2221. .22133@@ÑÑ22@@@@@    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ5@6@0115555?   551!_,b511!3@5$1!.b551?  551!  551!_ .511! ,55113@@@Ñ15@@@@@    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ9?  _5$_    _   _b@$1!cbb$1! bb9?! _b$!   _;;   -5$?  -b$1! _b9$1?b@@91!@@@@@    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ9!         --     --  WW0$4--==+4  -c=+   ==+   -cc   -W+1  =W4!   ==!!-=W#04@@@@@@    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ04Ñ=---    c+-  -==-   c44--=ÑÑ44--=W4+--cW4+- -W44-  W4+-  cW+44=W==4  -=#44ÑÑÑÑ0@@@@@@@    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ?   c+1?  c+#?. cc#!. -W#??--WÑ??4=WW#!.-cW#??-cW#?? -W#??  c+814ÑWÑ#1!-WÑÑ#4ÑÑÑÑ0#@@@@@@    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ22?.  222122b@Ñ222@ÑÑ222b222?  222122bÑ222cb22222bb222:Wb22222@ÑÑ12ÑÑÑÑ2!.bÑÑ122ÑÑÑ122@@@ÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ1  221?,b@@212@@@Ñ12@@@ÑÑ1@b221!  22213@@@Ñ133@@Ñ133@@@223@@@213@@ÑÑ11@@@$13325$1335@@2@@@@@ÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ5_,b$115@@@Ñ$@0@ÑÑÑ5@66Ñ?1  _,!  _5@$15@@@015@@@015@@@011@@@@115@@@Ñ11@@@5!! ,551?_@@@$15@@@ÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑb000@@@ÑÑÑÑÑÑÑ9!         _;_  -W00$9Wb@9$4Wb@099=Wb9$!=bb09$9Wb@0$1=WW@!   c@$1;@@Ñ00@Ñ@ÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ4   --    ---   cc- -WÑÑ04+WWÑ44+-W==+-  =W+4WWWW#4=WÑÑ04+-=W4+a+WW#04ÑÑÑÑ00ÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ4-  ==41  =W=4? -=4??-WÑÑ+4--W=#++=WÑ#44WWW#44ÑWÑÑ04ÑÑÑÑ#+4WWÑ004ÑÑÑÑ0#Ñ@ÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ71!.ÑWÑ22!WWÑÑ#2WWW22. .W22?.WWÑÑ#2ÑÑÑÑ#2ÑÑÑÑ##ÑÑÑÑÑ#2ÑÑÑ0#2ÑÑÑÑÑÑ@ÑÑ@@ÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ2222133@@Ñ22@@ÑÑÑ22ÑÑ27.  222?.3@ÑÑ22Ñ@ÑÑ22@@ÑÑÑ1ÑÑÑÑÑÑÑ@ÑÑÑÑ2ÑÑÑ@@ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ@_55113@@@Ñ15ÑÑ57?   55?   b51!3@@@Ñ15@@@ÑÑ1@@@ÑÑ1@@@ÑÑÑ@@@ÑÑÑ1ÑÑ@ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ@@b@915@609?   __    5$11_,b511!@@@011@@@Ñ915@@ÑÑ95@@ÑÑ95@@@@ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ09Ñ       -W=$+-WW#04=WW@$4+WWÑ044WWÑ000ÑÑÑÑ00ÑÑÑÑ@@ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ0a  -=+?--WÑ#44WWÑÑ0#ÑÑÑÑ044WWÑ044WWÑ004@@@@@ÑÑ@ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ0#4WWW#14WÑÑÑ##ÑÑÑÑ00ÑÑÑÑ7?ÑcÑW+!--44WWÑ004@ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ2ÑÑÑÑ12ÑÑÑÑ71  2221..222!.c@@@@Ñ@ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ2.22,   22113b@@Ñ22@@@Ñ22@@ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ55b5$!__bb5115@@@Ñ5@@@@Ñ0@@@0ÑÑÑÑ0ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$!  _c@?! -b9$15@@Ñ09Ñ@@ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ0!   ---  -=a4   -aa!  WÑ$44ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ7- -++   -=4+  =W4;   -4+-  c=44ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ1?7Ñc7!   -c?.  c#814WWÑÑ8! -Wa1. cWÑ##ÑÑÑÑÑÑ2ÑÑÑÑ0ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑ77?222?   .2?   .2?!.2@@Ñ12@@ÑÑÑ22b22213b2Ñ12ÑÑÑÑÑ22ÑÑÑ2132ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑ?251!  _5?!   ,5!   _21?_3@@ÑÑÑÑ@ÑÑÑÑ@@@@113@@@Ñ1@@@@Ñ11@@@21!3@@ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑ1   ,;    ,;_    __   _;;! ,@@0$550ÑÑÑÑÑ0@ÑÑ0@@@@Ñ55@@@Ñ$5@@@@11@0ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑ9          _;!         _c?!  W09$4ÑÑÑ000ÑÑÑÑ0ÑÑÑÑÑÑÑ@@@ÑÑ0@@@ÑÑ0@@ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑa    --    ---   ---   -=+-  WW+4--W=444+WÑÑ04ÑÑÑÑÑÑÑÑÑÑÑ0ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑ++-  -=+-   =++   ==7   cc?-  ==#!  WW+?.-=W#+?+WÑÑ+!4ÑÑÑ4!?ÑÑÑÑ17ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑb2?.  c22!  .c2?  .c7!   c22.  b22!  c2?!..W222?4W222? .W22?..W222!4WÑÑ122ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑ@@2!  b221  2221. _22?   22?.  222!  _22!  .222132@22132222133b@22332@Ñ122@ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑ@@1!__5511__b551!_,b51! _551!  _51!   511_,@@@$13@@@113@@@$11@@@$113@@@$1@0@ÑÑÑÑÑ@ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑ0@@$!  bb$!  bb9!! bb9$1 _b@$!  _;;_   ;;!!_b@00@@@@Ñ015@@@91@@@@099@@@Ñ0ÑÑ0ÑÑÑÑÑ0@ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑ#?  =W$4  =W0+  _c=+   c=+    --    =a++=WÑÑ00ÑÑÑÑ00@ÑWÑ004ÑÑÑÑ0@ÑÑÑÑ00ÑÑÑÑÑ0ÑÑÑÑÑ0ÑÑÑÑÑ0ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑ4=-WÑ#4+a=W44--==W4-  -W?    --   -W444WÑÑÑ00ÑÑÑÑÑ0ÑÑÑÑÑ0ÑÑÑÑÑ0#ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑ#4ÑWÑ#??4WW#?! -cc.   -ca!  WÑ###ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ2Ñb22222Ñ@222..c2222W2221  22Ñ12ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ@@@@113@@211_.22113 2211  .2221@@@ÑÑ13@@@21325221!3252133@@ÑÑ1ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ00011@@@@1?_ 55!!  _51?  b@$$15@@ÑÑ$5@@@$11@@b$11@@@011,5b0$156@ÑÑÑÑ6@ÑÑÑÑ0@ÑÑÑÑÑ@ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ@WWb9$!  b;;    _;!  bb090@@ÑÑÑ0Ñ@@Ñ09@@@@09@@@@Ñ09WW@Ñ00Ñ@ÑÑÑ0Ñ@@ÑÑ0ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑWWW+-  c=++- -=4++WWÑ00#ÑÑÑÑ00ÑÑÑÑ00ÑÑÑÑ004ÑÑÑÑ04ÑÑÑÑ00ÑÑÑÑÑ0ÑÑÑÑÑ0ÑÑÑÑÑ0ÑÑÑÑÑÑÑÑÑÑÑÑ0ÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ#+--W=4?  W=4!4ÑÑÑÑ0ÑÑÑÑÑÑ#ÑÑÑÑÑ0ÑÑÑÑÑ0ÑÑÑÑÑ0ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑWWÑ2!  c2#12ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ012ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ2._2@Ñ12ÑÑÑÑÑÑÑÑÑÑÑ22@@Ñ122@@ÑÑ22@ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ@@b@Ñ11Ñ@ÑÑÑÑÑ@@ÑÑÑ@@@@Ñ1@@@ÑÑÑ@@@@ÑÑÑÑ@@ÑÑÑÑ@@ÑÑÑÑÑ@ÑÑÑÑÑÑÑÑÑÑÑ0ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ0@@0$580ÑÑÑÑÑ@@ÑÑÑÑ6@ÑÑÑ@8@ÑÑÑÑ00ÑÑÑÑÑ0ÑÑÑÑ@0ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ0@@@@@0@=WW=$!cWÑÑ00ÑÑÑÑÑ0ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ@#ÑWW#4+W=WÑ044@@@0ÑÑÑÑÑ0ÑÑÑÑÑ00ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ0#ÑÑÑÑ##ÑÑÑÑÑ0ÑÑÑÑÑ0ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//    ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ    //
//                                                                                                                           //
//                                                                                                                           //
//                                                                                                                           //
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


contract TIDE is ERC721Creator {
    constructor() ERC721Creator("Tide", "TIDE") {}
}
