
// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: T̴͖͕͑̽͒R̵̢̻̝̿͌̚A̴͓̦̝͛̐̕N̵͍̠͖̽̀̈́S̸̙̪͊̽͐Ḿ̴̪͉͙͐͆Í̵̟͇̫̒̓Ș̸̫͕̀̚̕S̸̟͔̦̿̕̚I̵͓͍͑́͒͜O̸͉̞̙̐̀N̸̡̢͖̈́͌̐S̴͇̪̠̾̚͝
/// @author: manifold.xyz

import "./ERC721Creator.sol";

///////////////////////////////////////////////////////////////
//                                                           //
//                                                           //
//     ___,_  _   ,  , _, , , ___,_, _, ___,  _, ,  , _,     //
//    ' | |_)'|\  |\ |(_,|\/|' | (_,(_,' |   / \,|\ |(_,     //
//      |'| \ |-\ |'\| _)| `| _|_,_) _) _|_,'\_/ |'\| _)     //
//                                                           //
//                                                           //
///////////////////////////////////////////////////////////////


contract TRNSMIT is ERC721Creator {
    constructor() ERC721Creator(unicode"T̴͖͕͑̽͒R̵̢̻̝̿͌̚A̴͓̦̝͛̐̕N̵͍̠͖̽̀̈́S̸̙̪͊̽͐Ḿ̴̪͉͙͐͆Í̵̟͇̫̒̓Ș̸̫͕̀̚̕S̸̟͔̦̿̕̚I̵͓͍͑́͒͜O̸͉̞̙̐̀N̸̡̢͖̈́͌̐S̴͇̪̠̾̚͝", "TRNSMIT") {}
}
