
// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: Swimmers
/// @author: manifold.xyz

import "./ERC721Creator.sol";

//////////////////////////////////////////////////////////////////////////////////////////////////////
//                                                                                                  //
//                                                                                                  //
//       ˢ                                                ˢ                                    ˢ    //
//                                         ˢ                                       ⁱ                //
//                                               $ˢsⁱ                                               //
//           ˢ             ʷ                    $5S5s$                                              //
//                                              $Ƨɩˢs5ⁱ         ᵐ                       ˢ           //
//                                               s5$ˢ5ˢ                                             //
//                                            ᵐ  5s$ˢˢˢ                                             //
//                                               ˢssˢssⁱ ⁱⁱⁱ                                        //
//                                       ⁱ$ƧɩєWWǀMƧˢˢˢˢ5s55ssˢ$ⁱ                                    //
//               sⁱ          ˢ       ⁱsˢ5sѕƜǀммƐяѕs$ssss$sWWǀMƧˢss$          ᵉ                      //
//     ˢ         sⁱs            ⁱ$ˢssss5ˢˢssςωɿɱɱ૯Րςˢˢˢˢ$sˢˢs5ˢssˢssˢⁱ                              //
//               $5ˢˢ$$ⁱⁱⁱ$$sssɱɱ$ШЇѪѪЄЯ$ˢ55sⁱ $55$s5sЅss5s5s$ƨяɘммiwƨ5ˢ$         sˢ5               //
//                ˢⁱ$$ƧɩєSWMRS$ⁱ            ˢˢssˢ5ˢˢ5ssˢ5s5$      ⁱЅШιΜΜΣΓЅ$ⁱⁱⁱ sss5$ˢ              //
//                                           5ssssˢˢˢ5sss5s  ˢ        ˢⁱ$ƨшıммεяƨs$                 //
//                                           ˢˢsƧɩєWWǀMƧ$5ˢ                                         //
//                          ʷ                ˢˢssSWMRSƐяѕ5ˢ                                         //
//                                           ˢ5sςωɿɱɱ૯Րς55ˢ                           ʷ             //
//          ᵉ                       ʳ        ˢˢˢsⁱˢˢˢ5s5$ss                                         //
//                                          ⁱˢˢs5W!MM3R5s$$ᵐ                                        //
//                                          ˢ$5ЅˢƧɩєWWǀMƧ$s                                         //
//                                         $5sЅsƧɩєWWǀMƧЅs5ⁱ                                        //
//                    ⁱ                   $55ss5s%sЅssЅЅsЅs5ⁱ                                       //
//                                      $ˢ5sςωɿɱɱ૯ՐςsˢsЅs5s55$         ˢ                            //
//                                   ⁱs5sѕƜǀммƐяѕ5Ѕ5w1mm3r5ⁱnetsⁱ                                   //
//                                 $ˢˢ5ƨяɘмⱤØⱠⱠł₦ ⁱⁱⁱ$ˢⱠɆØ₦₳ⱤĐ5ˢsⁱ                                  //
//                              ⁱssssˢˢssˢˢˢ$           $ˢˢˢˢsЅ%sˢsⁱ                                //
//                ʳ            sˢs55s$sˢs                  $s5555ˢˢˢs                          ⁱ    //
//                           ⁱ5s5sˢ$ˢˢ$                      ⁱˢssЅ5ˢsˢ$                             //
//                          ⁱ5s5sss$         ʷ                 ⁱˢ5ˢ5s5ˢs       ʳ                    //
//                          s5ˢˢˢ$                               ⁱˢsˢЅЅˢs                           //
//                          5ѕs5$                                  s5ˢss5ⁱ                          //
//                          5Ƨssⁱ                             ˢ     sςssˢˢ                          //
//                        ⁱ ˢЅˢ$                                    ssss5$                          //
//           ⁱ              ss5s                                    ⁱЅƧs5  ˢ                        //
//                         ⁱssˢ$                                     5ЅЅ5                   ˢ       //
//                   $ˢ55ˢ5ˢssˢ         ʳ              ˢ             ⁱЅ55$                          //
//                  ⁱˢ5ˢˢssˢs$                                        $Ѕsssˢsⁱ                      //
//                    ⁱ ⁱⁱ                      ʳ                       sˢ55sЅsˢ                    //
//                                                                         ⁱ$ssˢ                    //
//                            ʷ                                                       ʷ             //
//      ˢ                                                  ˢ                                   ˢ    //
//                                                                                                  //
//                                                                                                  //
//////////////////////////////////////////////////////////////////////////////////////////////////////


contract SWMRS is ERC721Creator {
    constructor() ERC721Creator("Swimmers", "SWMRS") {}
}
