
// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: Unlimited Infinity
/// @author: manifold.xyz

import "./ERC721Creator.sol";

////////////////////////////////////////////////////////////////////////
//                                                                    //
//                                                                    //
//             ,▄                                                     //
//                                                                    //
//                       ▄▄▄▄▄ ▐█`                                    //
//                                                                    //
//                       █▌    ▐█` █▌   ██ ▐█  █▌     ███   ▐███      //
//                                                                    //
//                       ██▀▀▀ ▐█` █▌   ██ ▐█▀▀ ▐█U ▀▀▀▌,  █▌ ▀▀▀▀    //
//                                                                    //
//                       ██▄▄▄ ▐█` ▀▀▄▄▄▀▀ ▐█▄▄▄▄▀  ▄▄▄Γ▀  ▀▐▄▄▄      //
//                                                                    //
//                                    ██   ▐█▀                        //
//                                                                    //
//                                 ███Γ    ▐█                         //
//                                                                    //
//                                                                    //
//                                                                    //
//                                                                    //
//                                                                    //
//                                                                    //
////////////////////////////////////////////////////////////////////////


contract UNI is ERC721Creator {
    constructor() ERC721Creator("Unlimited Infinity", "UNI") {}
}
