
// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: Pure Soul / Dirty Ego by LETHAL
/// @author: manifold.xyz

import "./ERC1155Creator.sol";

///////////////////////////////////////////////////////////////////////////////
//                                                                           //
//                                                                           //
//                               ╓╗                                          //
//                           ▄▄       ╓#▓▀╙ªÆ▒▓█╝╜╙ ╖    ▓∩   ╓▓▓            //
//                           ██     ┌▒▀.▄╗φ  ▐█    .▒⌐  ┌▒   ¿▒ █▄  ▐▌       //
//                          ╒█▌     ▓▒▀╜██   │█    ║▒▌«▓▒▒  ╘▒▀╚▒▒╜ ╪█       //
//                          ██▄m▒███▌▒▓▓█▀   ║█    ███  ╘Mb å▀  █▌ ┌██▄      //
//                          ███▀└                  "╙    ▀      ╙" `▀▀▀▀╜    //
//                                                                           //
//                                                                           //
///////////////////////////////////////////////////////////////////////////////


contract PSDE is ERC1155Creator {
    constructor() ERC1155Creator() {}
}
