// SPDX-License-Identifier: MIT
pragma solidity >=0.4.22 <0.8.0;

//import "./ERC20.sol";
//import "./ERC20Detailed.sol";
import "./ERC20Full.sol";

contract BullToken is ERC20, ERC20Detailed {

    /*
    类别	成员钱包	百分比	数量	总量占比
    基金会	总计	15.00%	3150000.00 	15.00%

    1	阶段1	30.00%	945000.00 	4.50%
    2	阶段2	30.00%	945000.00 	4.50%
    3	阶段3	40.00%	1260000.00 	6.00%

    社区	总计	60.00%	12600000.00 	60.00%

    4	历史	20.00%	2520000.00 	12.00%
    5	社区推广	10.00%	1260000.00 	6.00%
    6	BULL矿机	60.00%	7560000.00 	36.00%
    7	活动	10.00%	1260000.00 	6.00%

    团队	总计	25.00%	5250000.00 	25.00%

    8	市场	60.00%	3150000.00 	15.00%
    9	运营	10.00%	525000.00 	2.50%
    10	技术	25.00%	1312500.00 	6.25%
    11	顾问	5.00%	262500.00 	1.25%
    */

    constructor() public ERC20Detailed("BullToken", "BULL", 18) {
        //单位
        uint256 coin = (10**uint256(decimals())); //1个币

        // -------------私网内测(development)------------------------------
        /*
        //基金会1-3 (15.00%)
        _mint(0x045511c06b3F614562Cd5fAe6a68D9f9901080bA, 945000 * coin); //1.阶段1: 945000.00 	4.50%
        _mint(0xD409D92E17f52c4F1d4797f5642A42bfCfFC6b4C, 945000 * coin); //2.阶段2: 945000.00 	4.50%
        _mint(0x4dD2bBd8B2aed48B9BE139a609997460F384C61d, 1260000 * coin); //3.阶段3: 1260000.00 	6.00%

        //社区4-7 (60.00%)
        _mint(0xf93a7588b6B98b88C357900Ffd2B1534596df005, 2520000 * coin); //4.历史: 2520000.00 	12.00%
        _mint(0x20B17e06580974D9A2946fE6cd7CC05D25600760, 1260000 * coin); //5.社区推广: 1260000.00 	6.00%
        _mint(0xd5F98D95F6270c66cC0AB0c961C15453a04D1f1c, 7560000 * coin); //6.BULL矿机: 7560000.00 	36.00%
        _mint(0x7E766497d0B6FCad189EaB79e94f752e24D9aB22, 1260000 * coin); //7.活动: 1260000.00 	6.00%

        //团队8-11 (25.00%)
        _mint(0xcF0056b50D6e1349c655CED8A1E7C5B3883D6288, 3150000 * coin); //8.市场: 3150000.00 	15.00%
        _mint(0xa0886EF3a98770d5FDAb4848aF67C7FAEade2CC1, 525000 * coin); //9.运营: 525000.00 	2.50%
        _mint(0x979f462660Fb2FdFaa49AF666015318f1e231d6c, 1312500 * coin); //10.技术: 1312500.00 	6.25%
        _mint(0x563F93944eF2b896933147A6a243120Fc685672b, 262500 * coin); //11.顾问: 262500.00 	1.25%
        */

        // -------------主网上线(mainnet)------------------------------
        //基金会1-3 (15.00%)
        _mint(0x73d5F0374e4A50377682664aA02bd9060ec83287, 945000 * coin); //1.阶段1: 945000.00 	4.50%
        _mint(0x089BB34cCcA019e562C361afe7D010c845e47ca3, 945000 * coin); //2.阶段2: 945000.00 	4.50%
        _mint(0x1dE7956B20C0396DDF1d8C72e40d02f669A5660D, 1260000 * coin); //3.阶段3: 1260000.00 	6.00%

        //社区4-7 (60.00%)
        _mint(0xE984e98348Bc07eF016cC293ea4582bcE905F5cF, 2520000 * coin); //4.历史: 2520000.00 	12.00%
        _mint(0x0FD732Cd7Acc74dA0B41c957bcFFaAFEA3593ed1, 1260000 * coin); //5.社区推广: 1260000.00 	6.00%
        _mint(0x2A9Eb34C7fE1a182427b84f98ef5Bc2876CCe389, 7560000 * coin); //6.BULL矿机: 7560000.00 	36.00%
        _mint(0x0C40fFD89eFa1deAa46143ED663056FB9c26037E, 1260000 * coin); //7.活动: 1260000.00 	6.00%

        //团队8-11 (25.00%)
        _mint(0xF31dca47E07238c42FCB28EF1476a3550C4a2EC5, 3150000 * coin); //8.市场: 3150000.00 	15.00%
        _mint(0xc6AfF2B20abbb4d77B98319117381E3B010D76e9, 525000 * coin); //9.运营: 525000.00 	2.50%
        _mint(0xd054930C9E9E2540369D879230A2D2293cd70871, 1312500 * coin); //10.技术: 1312500.00 	6.25%
        _mint(0x7458D76135346b4A2027ebF8540a6e67bD40E4FE, 262500 * coin); //11.顾问: 262500.00 	1.25%
    }

}
