
// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: T̴͖͕͑̽͒R̵̢̻̝̿͌̚A̴͓̦̝͛̐̕N̵͍̠͖̽̀̈́S̸̙̪͊̽͐Ḿ̴̪͉͙͐͆Í̵̟͇̫̒̓Ș̸̫͕̀̚̕S̸̟͔̦̿̕̚I̵͓͍͑́͒͜O̸͉̞̙̐̀N̸̡̢͖̈́͌̐S̴͇̪̠̾̚͝
/// @author: manifold.xyz

import "./ERC1155Creator.sol";

///////////////////////////////////////////////////////////////////////////////////////////
//                                                                                       //
//                                                                                       //
//    _   _| __  |  _  |   | |   __|     |     |   __|   __|     |     |   | |   __|     //
//      | | |    -|     | | | |__   | | | |-   -|__   |__   |-   -|  |  | | | |__   |    //
//      |_| |__|__|__|__|_|___|_____|_|_|_|_____|_____|_____|_____|_____|_|___|_____|    //
//                                                                                       //
//                                                                                       //
//                                                                                       //
///////////////////////////////////////////////////////////////////////////////////////////


contract TRNSMSSNS is ERC1155Creator {
    constructor() ERC1155Creator() {}
}
