
// SPDX-License-Identifier: MIT

pragma solidity ^0.8.0;

/// @title: mytest
/// @author: manifold.xyz

import "./ERC721Creator.sol";

////////////////////////////////////////////////////////////////////////////////////////////
//                                                                                        //
//                                                                                        //
//    ((ÿºººº(ºº)µºº)µº)ºººº)µ))º/Θ//\ººººººº\º___/º/µ≥≥)≥≥//\\/ºººº)\))ì))))µºΘºººººΓ    //
//                                                                                        //
//    ((ÿºººº(ºº)µºº)µº)ºººº)µ))º/Θ//\ºº_⌡▄*ⁿ~~   .~~º=q_≥≥//\\/ºººº)\))ì))))µºΘºººººΓ    //
//                                                                                        //
//    ((ÿºººº(ºº)µºº)µº)ºººº)µ))º/Θ//_gZE}~             ~╡q//\\/ºººº)\))ì))))µºΘºººººΓ    //
//                                                                                        //
//    ((ÿºººº(ºº)µºº)µº)ºººº)µ))º/Θ_4▀Ägº              j╡╡ç\_\\/ºººº)\))ì))))µºΘºººººΓ    //
//                                                                                        //
//    ((ÿºººº(ºº)µºº)µº)ºººº)µ))º/_ÑÜgg}            _a▄▄  {=ⁿºx_ºººº)\))ì))))µºΘºººººΓ    //
//                                                                                        //
//    ((ÿºººº(ºº)µºº)µº)ºººº)µ))º/$ÑggF            {▒%%Ü█æ$____}a__º)\))ì))))µºΘºººººΓ    //
//                                                                                        //
//    ((ÿºººº(ºº)µºº)µº)ºººº)µ))º/Ñ5gg}           _q▀▀▀▓▀46▓▄  ^X ~ⁿ*ç))ì))))µºΘºººººΓ    //
//                                                                                        //
//    ((ÿºººº(ºº)µºº)µº)ºººº)j▄æ▀Ñ▀▄42}j_______⌡⌡⌡#▄▄%%Ü▀▀ⁿ}~~~⌡*    {})ì))))µºΘºººººΓ    //
//                                                                                        //
//    ((ÿºººº(ºº)µºº)µº)º_▄6ÄggYÄp▀æ▄Ä⌂^^^_""^^_~⌡⌡ΣJ▄Ñ@▄__▓▄_▄*   _gPª)ì))))µºΘºººººΓ    //
//                                                                                        //
//    ((ÿºººº(ºº)µºº)µº)º$5gg▄æ▀2Ä#æ▀▀▀▀6▀▀@@@▀▀▀▀▀▀ººª~ⁿº~ . _⌡▄@▀º~\))ì))))µºΘºººººΓ    //
//                                                                                        //
//    ((ÿºººº(ºº)µºº)µº)ºⁿ▀▄▄pgg}   τª               __⌡▄▄▄▄█▀▀▀▀▀▀▀█W))ì))))µºΘºººººΓ    //
//                                                                                        //
//    ((ÿºººº(ºº)µºº)µº)ºººº~~ⁿº██▄▄▄▄▄▄▄▄▄▄▄▄▄██▒▀█▀▀▀▀▓▓▄▓▒ ² √C*ƒ▓F))ì))))µºΘºººººΓ    //
//                                                                                        //
//    ((ÿºººº(ºº)µºº)µº)ºººº)µ))~█[▄▓▀▀▓▓██▀▀▓@▓█çÅ*{Cⁿ¥{▓▓▓█ª  û*qY$}))ì))))µºΘºººººΓ    //
//                                                                                        //
//    ((ÿºººº(ºº)µºº)µº)ºººº)µ)){█▄▄██▀▓▀9Ñ▄H▄N▀█▒▄ppp$N▒Å¼ⁿ█▒▄▄▄▄&@▀ª))ì))))µºΘºººººΓ    //
//                                                                                        //
//    ((ÿºººº(ºº)µºº)µº)ºººº)µ))º▓█▄▒▓▄▄W4▒º~ _gÄÄÄ▀Npæ@▄Ü**MΓ,.▀▀ºº)\))ì))))µºΘºººººΓ    //
//                                                                                        //
//    ((ÿºººº(ºº)µºº)µº)ºººº)µ))º▀▒▄@ÑU@▀▄▄E▄~ⁿNS▄ⁿ▀▓ÑÑ██▒m*{█▒█Ü~ºº)\))ì))))µºΘºººººΓ    //
//                                                                                        //
//    ((ÿºººº(ºº)µºº)µº)ºººº)µ))º/δ█▀▀Ü▀MNLYÑN▄▄▄▓▄▄a▓▄███▄▄▄███mººº)\))ì))))µºΘºººººΓ    //
//                                                                                        //
//    ((ÿºººº(ºº)µºº)µº)ºººº)µ))º/Θ~█▄█æ█▀▀ ▓▄▄▓▒█████▀▀▓*▀ⁿ▀▀▓ⁿⁿººº)\))ì))))µºΘºººººΓ    //
//                                                                                        //
//    ((ÿºººº(ºº)µºº)µº)ºººº)µ))º/Θ//ⁿ▓p} }_█ª▀▀▓████████████▒~.ºººº)\))ì))))µºΘºººººΓ    //
//                                                                                        //
//    ((ÿºººº(ºº)µºº)µº)ºººº)µ))º/Θ//\ `H▀█▀▓▄  ▄▓▓▓██}}$_}{~}[~_ººº)\))ì))))µºΘºººººΓ    //
//                                                                                        //
//    ((ÿºººº(ºº)µºº)µº)ºººº)µ))º/Θ//\º_pdg▀██ygÖ▓██▓m}▀▀**=g▄#$]ººº)\))ì))))µºΘºººººΓ    //
//                                                                                        //
//    ((ÿºººº(ºº)µºº)µº)ºººº)µ))º/Θ//\ºⁿ███º/~▀▓▄U▄Ñ▀█▄▄▄__⌡ƒ▀{▓▄ººº)\))ì))))µºΘºººººΓ    //
//                                                                                        //
//    ((ÿºººº(ºº)µºº)µº)ºººº)µ))º/                                                        //
//                                                                                        //
//                                                                                        //
////////////////////////////////////////////////////////////////////////////////////////////


contract mytest is ERC721Creator {
    constructor() ERC721Creator("mytest", "mytest") {}
}
