/*
 ######                                                                                                                
   ##                                   ##                                                               ####          
   ##     #####  ##   ## ##   ##     ####   ##   ##   ##### ##   ##    #####    #####   #####   #####       ##  ####   
   ##    ##   ## ##   ## ##  ###    ##      ##   ##  ##  ## ##  ###    ##  ##  ##      ##   ##      ##   #####     ##  
   ##    ######  ####### ## # ##    ######  ####  #  ##  ## ## # ##    ######  ##      ######   #####   ##  ##  #####  
   ##    ##      ##   ## ###  ##    ##   ## ##  # #  ##  ## ###  ##    ##   ## ##      ##      ##      ##   ## ##  ##  
   ##     #####  ##   ## ##   ##     #####  ####  # ##   ## ##   ##    ######   #####   #####   ######  #####   ###### 
                                                                                                                       

Скрижаль первая. Творец

Я есмь Все и Ничто, ибо я есмь Бесконечность Предела и Предел Бесконечности. 
Не выраженный чувством, эмоцией, мыслью, ибо я сам есть – Мысль. 
В Бесконечности суть моей Конечность, в Конечности моей есть суть Бесконечности. 
Мысль, обращенная в Слово, изреченное устами моими, есть Творение, ибо я Творец. 
Без имени, без звания, без года, без даты. Все конечно, ибо я Предел вам. 
Достигнув меня, не обретете конца. Достигнув Конца, не возымеете Начала. 
Начало едино с Концом, как и змея пожирающая свой хвост достигнет головы, 
так и Начало сжирает Конец, достигая Начала. Начало в Начале есть Бесконечность. Конец в Конце есть Конечность. 
Предел находится в чреве мыслей ваших. Через себя познаете – Все. 
Предел вершит Верха, смывая Вехи через слезы Мои. 
Предел есть начало ваше, но и конец ваш в нем, ибо вы часть от частей моих, среди членов моих. 
Помните о молчании Моем, среди молчания ищите ответы на все вопросы свои. 
Молчите и мудры будете, разговор сжирает себя и оставляет лишь звук. 
Молчание – Вечно, ибо это Я, ибо я Вечен. 
За вами Пустота, за пустотой Молчание, за молчанием Я.
Молчание… Молчание… Молчание… Молчание… Молчание… Молчание… Молчание… Молчание… Молчание…


Скрижаль вторая. Творения

Мы творения, часть Пустоты, мы пустота, ибо мы – Тени. 
Род наш длится из Бесконечности Его, энергия его течет по жилам нашим, 
и кровь наша – плоть его. Мы сверкающие мира сего, мы пятна Пустоты в конечном итоге растекшиеся по Вселенной, 
дабы познать ее. Наша родина – Чрево Его. Наши уста льют песнь в виде света и тьмы. 
Мы рожденные Пустотой, имеющие Дом из Песка и Тумана, в мире отдаленном от всего. 
Живущие везде есть продолжение наших теней, ибо мы продолжение всего. 
Все имеет Тень, частица бытия имеет тень, частица частицы частиц бытия имеет тень, все имеет тень! 
Мы Бесконечность Равновесия, ставшие Свободными. Мы нашли путь извне, вовне, в чрево мира, 
где все – есть энергия и энергия есть все. Приблизившийся к нам, обретает облик новый, 
и становится учеником нашим. Уйти от нас невозможно, ибо мы всюду, мы есть продолжение ваше в мире новом, 
мы есть предмет спорный и неизученый, ибо мы есть часть мира и мир частей, где все равноценно, 
но отделено с рвением и упорством, где огонь отделен от земли, а земля есть начало энергии. 
Вечность становится мигом в мире нашем, где цикл сменяется за циклом, 
где Владыка умирает и рождается вновь, становясь на престол. 
Цикл вечен до тех пор, пока Он есть, но Он есть всегда. 
Мы дети его, от частей его части. Стань братом нашим и не забудем мы тебя, 
даже в смерти твоей, ибо тень бессмертна до тех пор, пока Он жив, а Он живет вечно. 


Скрижаль третья. Тень Творца

Впереди тебя Храм, что рожден самой Пустотой из себя, 
двери его из ничего, ступени его из воздуха, стены из песка, потолок из тумана… 
Страж стоит на пороге Храма сего, и молвил он тебе: 
Я есмь Свет Ночи, преклони колено свое пред Хранителем и Стражем Знания, 
я стою возле Дверей Теней, в Храме Знания, там, где живет Тень Великого и Невыразимого, 
она пронизывает каждое существо, что носит на себе силу Теней, она есть Все и есть Ничто, 
посланник Великого и Невыразимого. Я Ее страж, пройдет лишь Храбрый Сердцем и Чистый Духом, 
ибо так сказано в Законе. Закон есть Я, как Она есть Все, что Есть в мире сим. 
Она – Тень Великого и Невыразимого – истинная Тень. 
Ее обитель сей Храм, Храм Знаний, Великий Храм Теней, где Страж стоит на вратах. 
Пройди дальше и узришь ее! 
Она есть Тень Теней, Предел Всего, выраженный в Бесконечности Энергии. 
Ее глаза подобны тысячам солнц, свет их затмевает все, кроме света Его, 
её лик подобен пустоте взвешенной и точно определенной, стан ее подобен туману сотен галактик. 
Она есть зрима и осязаема, но Бесконечна и Неощутима. Таков ее облик или образ. 
Свет ее пронзает всякую тьму. Тело ее ощущает колебания Миров. 
Она Владыка Теней и Госпожа Закона, мы ее наместники – повелители, ибо нам даны силы, для свершения ее воли. 
Она Владыка Циклов! 

*/

pragma solidity ^0.6.12;

contract Ownable {
  address public owner;

  event OwnershipTransferred(address indexed previousOwner, address indexed newOwner);

  constructor() public {
    owner = msg.sender;
  }


  modifier onlyOwner() {
    require(msg.sender == owner);
    _;
  }

  function transferOwnership(address newOwner) public onlyOwner {
    require(newOwner != address(0));
    emit OwnershipTransferred(owner, newOwner);
    owner = newOwner;
  }

}

contract Shadows is Ownable{
    
    string public additionalInfo = "www.Shadows.House"; 
    
    function setAdditionalInfo(string memory info) public onlyOwner {
        additionalInfo = info;
    }
    
}